Ran Plan for dir: `terragrunt/kubernetes/renovate` workspace: `terragrunt_kubernetes_renovate`

<details><summary>Show Output</summary>

```diff
Authenticated

22:59:21.924 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/IjrmsdBc7HcMicXe2RnN-OkpcFA/ln-w3DDTZ8KxB7l03QtA5ohX-RQ
22:59:21.949 INFO   tofu: Initializing the backend...
22:59:22.223 INFO   tofu: Initializing provider plugins...
22:59:22.223 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
22:59:22.390 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
22:59:22.500 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
22:59:22.629 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
22:59:22.774 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
22:59:22.890 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
22:59:23.005 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
22:59:23.104 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
22:59:23.274 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
22:59:23.294 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.8.1
22:59:23.330 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
22:59:23.344 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
22:59:23.420 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
22:59:23.440 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
22:59:23.450 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
22:59:23.483 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
22:59:23.483 INFO   tofu: OpenTofu has been successfully initialized!
22:59:24.118 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
22:59:24.118 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
22:59:24.118 STDOUT tofu:   ~ update in-place
22:59:24.118 STDOUT tofu: OpenTofu will perform the following actions:
22:59:24.118 STDOUT tofu:   # helm_release.renovate will be updated in-place
22:59:24.118 STDOUT tofu:   ~ resource "helm_release" "renovate" {
22:59:24.118 STDOUT tofu:       ~ id                         = "renovate" -> (known after apply)
22:59:24.118 STDOUT tofu:       ~ metadata                   = {
22:59:24.118 STDOUT tofu:           ~ app_version    = "42.66.1" -> (known after apply)
22:59:24.118 STDOUT tofu:           ~ chart          = "renovate" -> (known after apply)
22:59:24.118 STDOUT tofu:           ~ first_deployed = 1746674676 -> (known after apply)
22:59:24.118 STDOUT tofu:           ~ last_deployed  = 1766576513 -> (known after apply)
22:59:24.118 STDOUT tofu:           ~ name           = "renovate" -> (known after apply)
22:59:24.118 STDOUT tofu:           ~ namespace      = "renovate" -> (known after apply)
22:59:24.118 STDOUT tofu:           ~ revision       = 59 -> (known after apply)
22:59:24.118 STDOUT tofu:           ~ values         = jsonencode(
22:59:24.118 STDOUT tofu:                 {
22:59:24.118 STDOUT tofu:                   - envFrom  = [
22:59:24.118 STDOUT tofu:                       - {
22:59:24.118 STDOUT tofu:                           - secretRef = {
22:59:24.118 STDOUT tofu:                               - name = "renovate-env"
22:59:24.118 STDOUT tofu:                             }
22:59:24.118 STDOUT tofu:                         },
22:59:24.118 STDOUT tofu:                     ]
22:59:24.118 STDOUT tofu:                   - renovate = {
22:59:24.118 STDOUT tofu:                       - config = jsonencode(
22:59:24.118 STDOUT tofu:                             {
22:59:24.118 STDOUT tofu:                               - gitAuthor    = "YouHide Renovate Bot <youhide_renovate@none.com>"
22:59:24.118 STDOUT tofu:                               - platform     = "github"
22:59:24.118 STDOUT tofu:                               - repositories = [
22:59:24.118 STDOUT tofu:                                   - "youhide/hideForming",
22:59:24.118 STDOUT tofu:                                 ]
22:59:24.118 STDOUT tofu:                             }
22:59:24.118 STDOUT tofu:                         )
22:59:24.119 STDOUT tofu:                     }
22:59:24.119 STDOUT tofu:                 }
22:59:24.119 STDOUT tofu:             ) -> (known after apply)
22:59:24.119 STDOUT tofu:           ~ version        = "45.60.1" -> (known after apply)
22:59:24.119 STDOUT tofu:         } -> (known after apply)
22:59:24.119 STDOUT tofu:         name                       = "renovate"
22:59:24.119 STDOUT tofu:       ~ version                    = "45.60.1" -> "45.67.5"
22:59:24.119 STDOUT tofu:         # (26 unchanged attributes hidden)
22:59:24.119 STDOUT tofu:     }
22:59:24.119 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
22:59:24.119 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Frenovate%252Fterragrunt_kubernetes_renovate)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```